# CanSetValue Method (Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..CanSetValue Method (Double)
ColorFillSchemeEntry Class See Also
---
Checks whether StorageType of entry is Double and the value is no less than 0.0.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool CanSetValue(
	double value
)
```

Visual Basic
---
```text
Public Function CanSetValue ( _
	value As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool CanSetValue(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double New Double value.
# ### Return Value
True if StorageType of the entry is Double and the value is finite, false otherwise.
# See Also
ColorFillSchemeEntry Class
CanSetValue Overload
Autodesk.Revit.DB Namespace